RIET/src/Catalogs/Contracts/Contracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Contracts</name>
  <attributes>
    <name>Seller</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>ConsignTo</name>
    <type>
      <types>CatalogRef.ConsignTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Incoterms</name>
    <type>
      <types>CatalogRef.Incoterms</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GOLD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/Contracts/ManagerModule.bsl
Функция ПолучитьДляInvoice(Дата, Seller, ConsignTo, Incoterms) Экспорт
	
	// Возвращает массив подходящих контрактов
	
	// Если какой-то параметр не передан - запрос ничего не вернет - выходим
	Если НЕ ЗначениеЗаполнено(Дата)
		ИЛИ НЕ ЗначениеЗаполнено(Seller)
		ИЛИ НЕ ЗначениеЗаполнено(ConsignTo)
		ИЛИ НЕ ЗначениеЗаполнено(Incoterms) Тогда
		
		Возврат Новый Массив;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Seller", Seller);	
	Запрос.УстановитьПараметр("ConsignTo", ConsignTo);
	Запрос.УстановитьПараметр("Incoterms", Incoterms);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Contracts.Ссылка
		|ИЗ
		|	Справочник.Contracts КАК Contracts
		|ГДЕ
		|	Contracts.Seller = &Seller
		|	И Contracts.ConsignTo = &ConsignTo
		|	И Contracts.Incoterms = &Incoterms
		|	И Contracts.Date <= &Дата
		|	И Contracts.ExpiryDate >= &Дата
		|	И (НЕ Contracts.ПометкаУдаления)";
		
	УстановитьПривилегированныйРежим(Истина);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
